---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetFabricAreasInHost
source: html/9cde5767-f653-44a5-2182-eccfa4e8fc55.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetFabricAreasInHost Method

Returns all FabricArea elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<FabricArea> GetFabricAreasInHost()
```